MikroElektronika/core_packages/PIC/XC8/def/PIC18F85K22/mcu.h
// Generated 05/01/2024 GMT

/*
 * Copyright © 2024, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F85K22_H_
#define _PIC18F85K22_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18F85K22
 */
#ifndef _XC_H_
#warning Header file pic18f85k22.h included directly. Use #include <xc.h> instead.
#endif

#include <__at.h>

/*
 * Register Definitions
 */

// Register: PMD3
#define PMD3 PMD3
extern volatile unsigned char           PMD3                __at(0xF16);
#ifndef _LIB_BUILD
asm("PMD3 equ 0F16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned CCP4MD                 :1;
        unsigned CCP5MD                 :1;
        unsigned CCP6MD                 :1;
        unsigned CCP7MD                 :1;
        unsigned CCP8MD                 :1;
    };
} PMD3bits_t;
extern volatile PMD3bits_t PMD3bits __at(0xF16);
// bitfield macros
#define _PMD3_CCP4MD_POSN                                   0x1
#define _PMD3_CCP4MD_POSITION                               0x1
#define _PMD3_CCP4MD_SIZE                                   0x1
#define _PMD3_CCP4MD_LENGTH                                 0x1
#define _PMD3_CCP4MD_MASK                                   0x2
#define _PMD3_CCP5MD_POSN                                   0x2
#define _PMD3_CCP5MD_POSITION                               0x2
#define _PMD3_CCP5MD_SIZE                                   0x1
#define _PMD3_CCP5MD_LENGTH                                 0x1
#define _PMD3_CCP5MD_MASK                                   0x4
#define _PMD3_CCP6MD_POSN                                   0x3
#define _PMD3_CCP6MD_POSITION                               0x3
#define _PMD3_CCP6MD_SIZE                                   0x1
#define _PMD3_CCP6MD_LENGTH                                 0x1
#define _PMD3_CCP6MD_MASK                                   0x8
#define _PMD3_CCP7MD_POSN                                   0x4
#define _PMD3_CCP7MD_POSITION                               0x4
#define _PMD3_CCP7MD_SIZE                                   0x1
#define _PMD3_CCP7MD_LENGTH                                 0x1
#define _PMD3_CCP7MD_MASK                                   0x10
#define _PMD3_CCP8MD_POSN                                   0x5
#define _PMD3_CCP8MD_POSITION                               0x5
#define _PMD3_CCP8MD_SIZE                                   0x1
#define _PMD3_CCP8MD_LENGTH                                 0x1
#define _PMD3_CCP8MD_MASK                                   0x20

// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0xF17);
#ifndef _LIB_BUILD
asm("PMD2 equ 0F17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CMP1MD                 :1;
        unsigned CMP2MD                 :1;
        unsigned CMP3MD                 :1;
        unsigned TMR5MD                 :1;
        unsigned TMR6MD                 :1;
        unsigned                        :1;
        unsigned TMR8MD                 :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0xF17);
// bitfield macros
#define _PMD2_CMP1MD_POSN                                   0x0
#define _PMD2_CMP1MD_POSITION                               0x0
#define _PMD2_CMP1MD_SIZE                                   0x1
#define _PMD2_CMP1MD_LENGTH                                 0x1
#define _PMD2_CMP1MD_MASK                                   0x1
#define _PMD2_CMP2MD_POSN                                   0x1
#define _PMD2_CMP2MD_POSITION                               0x1
#define _PMD2_CMP2MD_SIZE                                   0x1
#define _PMD2_CMP2MD_LENGTH                                 0x1
#define _PMD2_CMP2MD_MASK                                   0x2
#define _PMD2_CMP3MD_POSN                                   0x2
#define _PMD2_CMP3MD_POSITION                               0x2
#define _PMD2_CMP3MD_SIZE                                   0x1
#define _PMD2_CMP3MD_LENGTH                                 0x1
#define _PMD2_CMP3MD_MASK                                   0x4
#define _PMD2_TMR5MD_POSN                                   0x3
#define _PMD2_TMR5MD_POSITION                               0x3
#define _PMD2_TMR5MD_SIZE                                   0x1
#define _PMD2_TMR5MD_LENGTH                                 0x1
#define _PMD2_TMR5MD_MASK                                   0x8
#define _PMD2_TMR6MD_POSN                                   0x4
#define _PMD2_TMR6MD_POSITION                               0x4
#define _PMD2_TMR6MD_SIZE                                   0x1
#define _PMD2_TMR6MD_LENGTH                                 0x1
#define _PMD2_TMR6MD_MASK                                   0x10
#define _PMD2_TMR8MD_POSN                                   0x6
#define _PMD2_TMR8MD_POSITION                               0x6
#define _PMD2_TMR8MD_SIZE                                   0x1
#define _PMD2_TMR8MD_LENGTH                                 0x1
#define _PMD2_TMR8MD_MASK                                   0x40

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0xF18);
#ifndef _LIB_BUILD
asm("PMD1 equ 0F18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EMBMD                  :1;
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned RTCCMD                 :1;
        unsigned CTMUMD                 :1;
        unsigned PSPMD                  :1;
    };
} PMD1bits_t;
extern volatile PMD1bits_t PMD1bits __at(0xF18);
// bitfield macros
#define _PMD1_EMBMD_POSN                                    0x0
#define _PMD1_EMBMD_POSITION                                0x0
#define _PMD1_EMBMD_SIZE                                    0x1
#define _PMD1_EMBMD_LENGTH                                  0x1
#define _PMD1_EMBMD_MASK                                    0x1
#define _PMD1_TMR1MD_POSN                                   0x1
#define _PMD1_TMR1MD_POSITION                               0x1
#define _PMD1_TMR1MD_SIZE                                   0x1
#define _PMD1_TMR1MD_LENGTH                                 0x1
#define _PMD1_TMR1MD_MASK                                   0x2
#define _PMD1_TMR2MD_POSN                                   0x2
#define _PMD1_TMR2MD_POSITION                               0x2
#define _PMD1_TMR2MD_SIZE                                   0x1
#define _PMD1_TMR2MD_LENGTH                                 0x1
#define _PMD1_TMR2MD_MASK                                   0x4
#define _PMD1_TMR3MD_POSN                                   0x3
#define _PMD1_TMR3MD_POSITION                               0x3
#define _PMD1_TMR3MD_SIZE                                   0x1
#define _PMD1_TMR3MD_LENGTH                                 0x1
#define _PMD1_TMR3MD_MASK                                   0x8
#define _PMD1_TMR4MD_POSN                                   0x4
#define _PMD1_TMR4MD_POSITION                               0x4
#define _PMD1_TMR4MD_SIZE                                   0x1
#define _PMD1_TMR4MD_LENGTH                                 0x1
#define _PMD1_TMR4MD_MASK                                   0x10
#define _PMD1_RTCCMD_POSN                                   0x5
#define _PMD1_RTCCMD_POSITION                               0x5
#define _PMD1_RTCCMD_SIZE                                   0x1
#define _PMD1_RTCCMD_LENGTH                                 0x1
#define _PMD1_RTCCMD_MASK                                   0x20
#define _PMD1_CTMUMD_POSN                                   0x6
#define _PMD1_CTMUMD_POSITION                               0x6
#define _PMD1_CTMUMD_SIZE                                   0x1
#define _PMD1_CTMUMD_LENGTH                                 0x1
#define _PMD1_CTMUMD_MASK                                   0x40
#define _PMD1_PSPMD_POSN                                    0x7
#define _PMD1_PSPMD_POSITION                                0x7
#define _PMD1_PSPMD_SIZE                                    0x1
#define _PMD1_PSPMD_LENGTH                                  0x1
#define _PMD1_PSPMD_MASK                                    0x80

